.config/doom/config.org
#+property: header-args :exports code :results silent :tangle config.el :noweb no-export

* Preface

#+include: README.org

** How this all works.
This document tangles into multipe files, =config.el=, =packages.el= and =init.el=. If you're reading this on the web or an exported version some code blocks may not be visible.
If you plan on copying (which I can't recommend, I'm an idiot) please view the entire =config.org= file.

* Doom Modules
:PROPERTIES:
:header-args: :tangle no :results silent :noweb-ref doom-modules
:END:

All of my used doom modules appear in the following sections.
#+begin_src emacs-lisp :tangle init.el :noweb no-export :noweb-ref no
(doom!
 <<doom-modules>>
 )
#+end_src

** Completion
#+begin_src emacs-lisp
:completion
(company
 +childframe
 +tng)

(ivy
 +fuzzy
 +icons
 +prescient)

(vertico
 +icons)
#+end_src

** UI
:PROPERTIES:
:CUSTOM_ID: doom-ui
:END:

#+begin_src emacs-lisp
:ui
deft
doom
doom-dashboard
(emoji +unicode)
hl-todo
modeline
nav-flash
ophints
(popup +defaults)
(vc-gutter +pretty)
vi-tilde-fringe
workspaces
ligatures
#+end_src

** Editor
Evil keybindings (VIm) everywhere. Also snippets.
#+begin_src emacs-lisp
:editor
(evil +everywhere)
file-templates
fold
(format +onsave)
rotate-text
snippets
#+end_src

** Emacs
~dired~ with icons, vc, and some great undo
#+begin_src emacs-lisp
:emacs
(dired
 +icons)
electric
undo
vc
#+end_src

** Term
~vterm~ is my emacs terminal emulator of choice.
#+begin_src emacs-lisp
:term
vterm
#+end_src

** Checkers
I only enable syntax checkers here.
#+begin_src emacs-lisp
:checkers
(syntax +childframe)
#+end_src

** Tools
Some lovely additions to emacs. I use eglot here since it will (soon) be included in emacs.
#+begin_src emacs-lisp
:tools
direnv
editorconfig
ein
(eval +overlay)
lookup
(lsp +eglot)
(magit +forge)
pdf
tree-sitter
#+end_src

** OS
Because I'm still (mostly) doing work in macos, I enable it here.
#+begin_src emacs-lisp
:os
(:if IS-MAC macos)
#+end_src

** Languages
:PROPERTIES:
:CUSTOM_ID: doom-lang
:END:
I enable a lot of packages in this section. It is OK though as they aren't loaded until needed so there is no impact just enabling them.
#+begin_src emacs-lisp
:lang
(cc
 +lsp
 +tree-sitter)
(clojure
 +lsp
 +tree-sitter)
common-lisp
data
(elixir
 +lsp
 +tree-sitter)
emacs-lisp
(erlang
 +lsp
 +tree-sitter)
(go
 +lsp
 +tree-sitter)
(java
 +lsp
 +tree-sitter)
(javascript
 +lsp
 +tree-sitter)
(lua
 +fennel
 +lsp
 +tree-sitter)
markdown
(nix
 +tree-sitter)
(org
 +journal
 +pretty
 +roam2)
(php
 +lsp
 +tree-sitter)
(python
 +lsp
 +tree-sitter
 +poetry)
rest
(ruby
 +rails
 +tree-sitter)
(rust
 +lsp
 +tree-sitter)
sh
(web
 +lsp
 +tree-sitter)
yaml
(zig
 +lsp
 +tree-sitter)
#+end_src

** Email
None of these packages are enabled, but I keep this here in the event that one day I want to enable one of them.
#+begin_src emacs-lisp
:email
;;(mu4e +org +gmail)
;;notmuch
;;(wanderlust +gmail)
#+end_src

** Apps
Same goes for this section, I use other programs to handle these, but maybe one day I'll decide to never leave emacs.
#+begin_src emacs-lisp
:app
;;calendar
;;emms
;;everywhere        ; *leave* Emacs!? You must be joking
;;irc               ; how neckbeards socialize
;;(rss +org)        ; emacs as an RSS reader
;;twitter           ; twitter client https://twitter.com/vnought
#+end_src

** Config
Enable bindings and tell doom emacs that this is a literate config.
#+begin_src emacs-lisp
:config
literate
(default +bindings +smartparens)
#+end_src

* Personalization
Setup name and email
#+begin_src emacs-lisp
(setq user-full-name "Evan Riley"
      user-mail-address "evan@evanriley.dev")
#+end_src

Store ~.authinfo.gpg~ in my home directory so that it isn't lost all the time.
#+begin_src emacs-lisp
(setq auth-sources '("~/.authinfo.gpg")
      auth-source-cache-expiry nil) ; default is 7200 (2h)
#+end_src

Some simple default settings.
#+begin_src emacs-lisp
(setq-default
 delete-by-moving-to-trash t                      ; Delete files to trash
 window-combination-resize t                      ; take new window space from all other windows (not just current)
 x-stretch-cursor t)                              ; Stretch cursor to the glyph width

(setq undo-limit 80000000                         ; Raise undo-limit to 80Mb
      evil-want-fine-undo t                       ; By default while in insert all changes are one big blob. Be more granular
      auto-save-default t                         ; Nobody likes to loose work, I certainly don't
      password-cache-expiry nil                   ; I can trust my computers ... can't I?
      ;; scroll-preserve-screen-position 'always     ; Don't have `point' jump around
      scroll-margin 2                             ; It's nice to maintain a little margin
      display-time-default-load-average nil)      ; I don't think I've ever found this useful

(display-time-mode 1)                             ; Enable time in the mode-line

(global-subword-mode 1)                           ; Iterate through CamelCase words
#+end_src

By default changes made via a customisation interface are added to =init.el=.
I prefer the idea of using a separate file for this. We just need to change a
setting, and load it if it exists.
#+begin_src emacs-lisp
(setq-default custom-file (expand-file-name ".custom.el" doom-private-dir))
(when (file-exists-p custom-file)
  (load custom-file))
#+end_src
* UI
** General
Some general settings to setup how emacs looks.

Enable line numbers, and use relative line numbers
#+begin_src emacs-lisp
(setq display-line-numbers-type 'relative)
#+end_src

Setup the ~fill-column~ to be wider by default
80 characters simply isn't wide enough today.
#+begin_src emacs-lisp
(setq-default fill-column 100)
#+end_src

Increase the amount of context lines when scrolling full-screen
#+begin_src emacs-lisp
(setq next-screen-context-lines 8)
#+end_src

Ensure ~dired-omit-mode~ is not started with dired. It hides some files transparently.
#+begin_src emacs-lisp
(after! dired
  (remove-hook 'dired-mode-hook 'dired-omit-mode))
#+end_src

By default bookmarked lines are highlighted in an annoying orange background which often removes other formatting. This disables that.
#+begin_src emacs-lisp
(after! bookmark
  (setq bookmark-fontify nil))
#+end_src

Start emacs in a bigger window.
#+begin_src emacs-lisp
(add-to-list 'default-frame-alist '(height . 40))
(add-to-list 'default-frame-alist '(width . 90))
#+end_src

** Fonts
Setup my preferred fonts.
#+begin_src emacs-lisp
(setq doom-font (font-spec :family "0xProto" :size 17)
      doom-big-font (font-spec :family "OxProto" :size 32)
      doom-variable-pitch-font (font-spec :family "Overpass" :size 17)
      doom-unicode-font (font-spec :family "JuliaMono")
      doom-serif-font (font-spec :family "IBM Plex Mono" :size 22 :weight 'light))
#+end_src



** Theme
Unpin ~doom-themes~
#+begin_src emacs-lisp :tangle packages.el
(unpin! doom-themes)
#+end_src

#+begin_src emacs-lisp
(setq doom-theme 'doom-vibrant)
#+end_src

Let's delete the defaults, doom-themes is enough for me.
#+begin_src emacs-lisp
(delq! t custom-theme-load-path)
#+end_src

Fix loading order to prevent ansi-color errors
#+begin_src emacs-lisp
(remove-hook 'window-setup-hook #'doom-init-theme-h)
(add-hook 'after-init-hook #'doom-init-theme-h 'append)
#+end_src
